
[
 "Did you know? Mount Everest is the tallest mountain on Earth.",
  "Fun fact: Honey never spoils; archaeologists found edible honey in ancient Egyptian tombs.",
  "Math fact: A circle has 360 degrees.",
  "Science fact: Water expands when it freezes.",
  "Did you know? The Sahara Desert is the largest hot desert in the world.",
  "Fun fact: Bananas are berries, but strawberries are not.",
  "Math fact: Pi (π) is an irrational number.",
  "Science fact: The human body is about 60% water.",
  "Did you know? The Pacific Ocean is larger than all the landmasses combined.",
  "Fun fact: Octopuses have three hearts.",
  "Math fact: A triangle’s angles always add up to 180 degrees.",
  "Science fact: Earth’s atmosphere is about 78% nitrogen.",
  "Did you know? The Great Wall of China is over 21,000 km long.",
  "Fun fact: Koalas sleep up to 20 hours a day.",
  "Math fact: Prime numbers are only divisible by 1 and themselves.",
  "Science fact: Lightning is hotter than the surface of the sun.",
  "Did you know? Africa has 54 countries.",
  "Fun fact: Penguins can’t fly, but they are excellent swimmers.",
  "Math fact: An even number is divisible by 2.",
  "Science fact: Plants make their food through photosynthesis.",
  "Did you know? Lake Victoria is the largest lake in Africa.",
  "Fun fact: Dolphins use echolocation to find food.",
  "Math fact: There are infinitely many prime numbers.",
  "Science fact: The ozone layer protects Earth from harmful UV rays.",
  "Did you know? Antarctica is the coldest place on Earth.",
  "Fun fact: Elephants are the only animals that can’t jump.",
  "Math fact: A square has four equal sides.",
  "Science fact: The Milky Way is our galaxy.",
  "Did you know? The Amazon rainforest produces 20% of the world’s oxygen.",
  "Fun fact: Giraffes have the same number of neck bones as humans (seven).",
  "Math fact: The Fibonacci sequence starts with 0, 1, 1, 2, 3, 5, 8…",
  "Science fact: Sound travels faster in water than in air.",
  "Did you know? The moon controls the ocean tides.",
  "Fun fact: Cows have best friends and get stressed when separated.",
  "Math fact: A rectangle has two pairs of parallel sides.",
  "Science fact: Sharks existed before trees.",
  "Did you know? The Sahara Desert can be as hot as 50°C (122°F).",
  "Fun fact: Sloths can hold their breath longer than dolphins.",
  "Math fact: Negative times negative equals positive.",
  "Science fact: The human brain has about 86 billion neurons."
]